app/controllers/stories_controller.rb

  def index
    @stories = Story.all
---
SELECT * FROM "stories"

  def edit
    @story = Story.find(params[:id])
---
SELECT * FROM "stories" WHERE ("stories"."id" = 1)

  def create
    @story = Story.new(params[:story])
	saved = @story.save

    if params[:estimate].length > 0
      Task.create_from_story(@story, params[:estimate])
---
INSERT INTO "stories" ("sprint_id", "category", "created_at", "updated_at", "technical_value", "description", "business_value", "status") VALUES(1, 'feature', '2012-01-18 13:01:34', '2012-01-18 13:01:34', NULL, 'As a user, I should not be able to see the "place your bets" button until I have made a valid selection on the racing exotics screen', 5, 'concept bin')
INSERT INTO "tasks" ("is_story", "created_at", "updated_at", "user_id", "story_id", "actual", "description", "status", "estimate") VALUES('t', '2012-01-18 13:41:07', '2012-01-18 13:41:07', NULL, NULL, NULL, NULL, 'open', 30)

  def destroy
    @story = Story.find(params[:id])
    @story.destroy
---
SELECT * FROM "stories" WHERE ("stories"."id" = 2)
DELETE FROM "stories" WHERE "id" = 2